In [3]:
import pandas as pd

In [4]:
items = {'bob':pd.Series([245,25,35],index=['bike','pants','watch']),'alice':pd.Series([245,25,35],index=['bike','pants','watch'])}

In [5]:
type(items)

dict

In [6]:
shopping_carts = pd.DataFrame(items)

In [7]:
shopping_carts

       bob  alice
bike   245    245
pants   25     25
watch   35     35

In [8]:
shopping_carts.columns

Index(['bob', 'alice'], dtype='object')

In [9]:
shopping_carts.values

array([[245, 245],
       [ 25,  25],
       [ 35,  35]], dtype=int64)

In [10]:
shopping_carts.shape

(3, 2)

In [11]:
shopping_carts.ndim

2

In [12]:
shopping_carts.size

6

In [13]:
bob_shopping_cart = pd.DataFrame(items,index = ['bike','pants'],columns=["bob"])

In [14]:
bob_shopping_cart

       bob
bike   245
pants   25

In [20]:
data = {'Itegers':[1,2,3],
        'Floats':[4,5,8.2]}

In [21]:
pd.DataFrame(data)

   Itegers  Floats
0        1     4.0
1        2     5.0
2        3     8.2

In [22]:
pd.DataFrame(data,index=['label 1','label 2','label 3'])

         Itegers  Floats
label 1        1     4.0
label 2        2     5.0
label 3        3     8.2

In [23]:
items = [{'bikes':20,'pants':30,'watches':35},{'watches':50,'bikes':15,'pants':5}]

store_items = pd.DataFrame(items,index=['store 1','store 2'])
store_items

         bikes  pants  watches
store 1     20     30       35
store 2     15      5       50

In [24]:
store_items[['bikes','pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [25]:
store_items.loc[['store 1']]

         bikes  pants  watches
store 1     20     30       35

In [26]:
 store_items['bikes']['store 2']

15

In [27]:
store_items['shirts']=[15,2]
store_items

         bikes  pants  watches  shirts
store 1     20     30       35      15
store 2     15      5       50       2

In [29]:
new_items = [{'bikes':20,'pants':30,'watches':35,'glasses': 4}]
new_store = pd.DataFrame(new_items,index=['store 3'])

In [30]:
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [39]:
store_items = store_items.append(new_store)
store_items

         bikes  glasses  pants  shirts  watches
store 1     20      NaN     30    15.0       35
store 2     15      NaN      5     2.0       50
store 3     20      4.0     30     NaN       35
store 3     20      4.0     30     NaN       35
store 3     20      4.0     30     NaN       35
store 3     20      4.0     30     NaN       35
store 3     20      4.0     30     NaN       35
store 3     20      4.0     30     NaN       35
store 3     20      4.0     30     NaN       35

In [41]:
#store_items['new_watches'] = store_items['watches'][1:]

#store_items

In [43]:
#store_items.insert(5,'shoes',[8,5,0])
#store_items

#store_items.pop["new_watches"]
#store_items

In [45]:
store_items=store_items.drop(['watches','shirts'],axis=1)
store_items

         bikes  glasses  pants
store 1     20      NaN     30
store 2     15      NaN      5
store 3     20      4.0     30
store 3     20      4.0     30
store 3     20      4.0     30
store 3     20      4.0     30
store 3     20      4.0     30
store 3     20      4.0     30
store 3     20      4.0     30

In [46]:
store_items = store_items.drop(['store 1','store 2'],axis = 0)

In [47]:
store_items

         bikes  glasses  pants
store 3     20      4.0     30
store 3     20      4.0     30
store 3     20      4.0     30
store 3     20      4.0     30
store 3     20      4.0     30
store 3     20      4.0     30
store 3     20      4.0     30

In [51]:
 store_items = store_items.rename(columns={'bikes':'hats'})

In [52]:
store_items

         hats  glasses  pants
store 3    20      4.0     30
store 3    20      4.0     30
store 3    20      4.0     30
store 3    20      4.0     30
store 3    20      4.0     30
store 3    20      4.0     30
store 3    20      4.0     30

In [54]:
store_items = store_items.rename(index ={'store 3':'last remaining store'})

In [55]:
store_items

                      hats  glasses  pants
last remaining store    20      4.0     30
last remaining store    20      4.0     30
last remaining store    20      4.0     30
last remaining store    20      4.0     30
last remaining store    20      4.0     30
last remaining store    20      4.0     30
last remaining store    20      4.0     30

In [56]:
store_items = store_items.set_index('pants')

In [57]:
store_items

       hats  glasses
pants
30       20      4.0
30       20      4.0
30       20      4.0
30       20      4.0
30       20      4.0
30       20      4.0
30       20      4.0

For detecting errors before analysing the data, we must minimize the no. of Nan values sby detecting it as the operations take place in the form of logical 1 and 0.

In [58]:
# x = store_items.isnull() --> in the form of true and false

In [59]:
# x = store_items.isnull().sum().sum() -->gives no. of Nan values
#print(x)

In [61]:
#store_items.count() counts in how many index there are logial True's
#store_items.dropna(axis=0) eleminates nan values

In [62]:
#store_items.drops(axis=1)

In [63]:
#store_items.fillna(method='ffill',axis=0) "forwaard fill of Nan values along row"

In [64]:
#store_items.fillna(method='ffill',axis=1) "backward fill"

In [65]:
#store_items.interpolate[method='linear',axis=0]

In [ ]:
#store_items.interpolate[method='linear',axis=1]